[
  {
    "slug": "bitcoin-atms-convenience-meets-risk",
    "title": "Bitcoin ATMs: Convenience Meets Risk—Here's What You Need to Know",
    "date": "2025-03-26",
    "description": "Bitcoin ATMs offer easy crypto transactions, but beware of scams. Learn how to stay safe.",
    "categories": [
      "Bitcoin",
      "Scams",
      "Guides"
    ],
    "tags": [
      "Bitcoin ATM",
      "Crypto Scams",
      "Safety Tips"
    ],
    "content": {
      "compiledSource": "\"use strict\";\nconst {jsxDEV: _jsxDEV} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = {\n    p: \"p\",\n    ..._provideComponents(),\n    ...props.components\n  };\n  return _jsxDEV(_components.p, {\n    children: \"This is a test article data\"\n  }, undefined, false, {\n    fileName: \"<source.js>\",\n    lineNumber: 2,\n    columnNumber: 1\n  }, this);\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsxDEV(MDXLayout, {\n    ...props,\n    children: _jsxDEV(_createMdxContent, {\n      ...props\n    }, undefined, false, {\n      fileName: \"<source.js>\"\n    }, this)\n  }, undefined, false, {\n    fileName: \"<source.js>\"\n  }, this) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n",
      "frontmatter": {},
      "scope": {}
    }
  },
  {
    "slug": "crypto-com-probe-by-the-sec-has-officially-closed-says-ceo",
    "title": " Crypto.com probe by the SEC has officially closed, says CEO ",
    "date": "2025-03-28",
    "description": "The US Securities and Exchange Commission has officially closed its investigation into Crypto.com, with no action taken against the crypto exchange, according to the firm’s CEO, Kris Marszalek. ”They used every tool available to attempt to stifle us, restricting access to banking, auditors, investors, and beyond. It was a calculated attempt to put an end to the industry,” Marszalek said in a March 27 X post. ”The fact that we not only persevered but became stronger is a testament to our vision and the community supporting it. Onwards!” It comes seven months after the SEC issued a Wells notice to the crypto platform in August, signaling its intention to take legal action against the firm. We are pleased that the current SEC leadership has made the decision to close its investigation into Crypto.com,” added Crypto.com’s chief legal officer Nick Lundgren in a March 27 statement, which accused the previous administration of abusing its authority to harm the crypto industry.\nSource: Kris Marszalek\nCrypto.com had filed a lawsuit against the SEC in October, two months after the Wells notice, accusing the Gary Gensler-led commission of overstepping its authority and taking a “misguided” approach to crypto regulation. SEC continues to roll back previous enforcement actions Crypto.com’s announcement follows a wave of other crypto investigations and lawsuits dropped by the SEC over the last five weeks, which affected the likes of Coinbase, Consensys, Robinhood, Gemini, Uniswap, OpenSea and more recently, Immutable. The SEC also dismissed its civil enforcement action against crypto trading firm Cumberland DRW with prejudice on March 27. Related: Ripple will drop cross-appeal in SEC case, get refund from lower court ruling The SEC has adopted a far friendlier approach since Mark Uyeda started leading the commission as acting chair on Jan. 20 after the resignation of former chair Gary Gensler. The SEC established a Crypto Task Force led by SEC Commissioner Hester Peirce to support this new approach.  It also canceled a controversial rule that asked financial firms holding crypto to record them as liabilities on their balance sheets on Jan. 23. Trump’s SEC chair nominee, Paul Atkins, is inching closer to becoming the SEC’s new leader after initially being held back by financial disclosures. Meanwhile, Crypto.com partnered with Trump Media on March 24 to launch a series of “Made in America”-themed exchange-traded funds later this year. Crypto.com will provide the infrastructure and custody services to supply the crypto tokens for the ETFs, which may include a basket of tokens, including Bitcoin (BTC), Ether (ETH), Solana (SOL), XRP (XRP) and Cronos (CRO). Magazine: SEC’s U-turn on crypto leaves key questions unanswered",
    "categories": [
      "Cryptocurrency"
    ],
    "tags": [
      "News",
      "Crypto"
    ],
    "content": {
      "compiledSource": "\"use strict\";\nconst {Fragment: _Fragment, jsxDEV: _jsxDEV} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  return _jsxDEV(_Fragment, {\n    children: [_jsxDEV(\"section\", {\n      children: [_jsxDEV(\"img\", {\n        src: \"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTM4Y2EtZWIyMy03ZWE2LTk0ZmItN2ZjYjQ0YmMzNTZk.jpg\",\n        alt: \"Crypto.com probe by the SEC has officially closed, says CEO\",\n        style: \"float:right; margin:0 0 10px 15px; width:240px;\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 3,\n        columnNumber: 3\n      }, this), _jsxDEV(\"p\", {\n        children: \"The US Securities and Exchange Commission (SEC) has officially closed its investigation into Crypto.com, without taking any action against the crypto exchange, per a statement from firm’s CEO, Kris Marszalek.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 4,\n        columnNumber: 3\n      }, this), _jsxDEV(\"blockquote\", {\n        children: \"“They used every tool available to attempt to stifle us, restricting access to banking, auditors, investors, and beyond. It was a calculated attempt to put an end to the industry,” Marszalek said in a March 27 X post. “The fact that we not only persevered but became stronger is a testament to our vision and the community supporting it. Onwards!”\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 6,\n        columnNumber: 3\n      }, this), _jsxDEV(\"p\", {\n        children: \"The SEC had issued a Wells notice to Crypto.com in August, signaling its intention to take legal action against the firm. However, the organization has now made the decision to close its investigation, as announced by Crypto.com's Chief Legal Officer Nick Lundgren. He accused the previous administration of abusing its authority to harm the crypto industry.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 8,\n        columnNumber: 3\n      }, this), _jsxDEV(\"figure\", {\n        children: [_jsxDEV(\"img\", {\n          alt: \"SEC, Crypto.com\",\n          src: \"https://s3.cointelegraph.com/uploads/2025-03/0195da27-6820-73a5-9e65-8da46324b8b0\"\n        }, undefined, false, {\n          fileName: \"<source.js>\",\n          lineNumber: 11,\n          columnNumber: 5\n        }, this), _jsxDEV(\"figcaption\", {\n          children: \"Source: Kris Marszalek\"\n        }, undefined, false, {\n          fileName: \"<source.js>\",\n          lineNumber: 12,\n          columnNumber: 5\n        }, this)]\n      }, undefined, true, {\n        fileName: \"<source.js>\",\n        lineNumber: 10,\n        columnNumber: 3\n      }, this), _jsxDEV(\"p\", {\n        children: \"In October, Crypto.com filed a lawsuit against the SEC, accusing it of overstepping its authority and taking a misguided approach to crypto regulation.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 15,\n        columnNumber: 3\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 2,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Market Implications and Future Outlook\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 19,\n        columnNumber: 3\n      }, this), _jsxDEV(\"p\", {\n        children: \"The recent development marks a significant victory for Crypto.com and could potentially influence the future regulatory landscape for other crypto exchanges. The SEC's decision to close its investigation also follows recent dismissals of cases against other major industry players, signaling a potential shift in the US regulatory stance towards cryptocurrency entities.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 20,\n        columnNumber: 3\n      }, this), _jsxDEV(\"p\", {\n        children: \"In a climate of increased regulatory scrutiny around the world, the US SEC's decision could set a precedent that might affect how other international regulatory bodies approach cryptocurrency exchange investigations. With the SEC's recent activities involving Coinbase, Robinhood, and Gemini, the ruling in favor of Crypto.com may indicate a possible softening stance on crypto regulations.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 22,\n        columnNumber: 3\n      }, this), _jsxDEV(\"p\", {\n        children: \"The close of the investigation does not signal the end of the complex relationship between Crypto.com and the SEC, but it does mark a significant milestone in the exchange's legal battle with the US regulatory body. As the firm continues to expand its services and partnerships, the recent development will undoubtedly bolster its credibility to its user base and partners.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 24,\n        columnNumber: 3\n      }, this), _jsxDEV(\"p\", {\n        children: \"The future implications of this development for the market will be closely watched by investors, market participants, and other cryptocurrency firms. As the cryptocurrency landscape continues to evolve, so too will the regulatory environment, making for an interesting dynamic in the industry.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 26,\n        columnNumber: 3\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 18,\n      columnNumber: 1\n    }, this)]\n  }, undefined, true, {\n    fileName: \"<source.js>\",\n    lineNumber: 1,\n    columnNumber: 1\n  }, this);\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsxDEV(MDXLayout, {\n    ...props,\n    children: _jsxDEV(_createMdxContent, {\n      ...props\n    }, undefined, false, {\n      fileName: \"<source.js>\"\n    }, this)\n  }, undefined, false, {\n    fileName: \"<source.js>\"\n  }, this) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n",
      "frontmatter": {},
      "scope": {}
    }
  },
  {
    "slug": "ethereum-layer-2-solutions-hit-new-milestone-with-10m-daily-transactions",
    "title": "Ethereum Layer 2 Solutions Hit New Milestone with 10M Daily Transactions",
    "date": "2025-03-28",
    "description": "Ethereum's Layer 2 scaling solutions have reached a significant milestone, collectively processing over 10 million daily transactions, surpassing the mainnet's throughput for the first time. This achievement marks a crucial turning point in Ethereum's scaling journey.",
    "categories": [
      "Cryptocurrency",
      "Market Analysis",
      "Technology"
    ],
    "tags": [
      "Market Update",
      "Analysis",
      "Trends"
    ],
    "content": {
      "compiledSource": "\"use strict\";\nconst {Fragment: _Fragment, jsxDEV: _jsxDEV} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  return _jsxDEV(_Fragment, {\n    children: [_jsxDEV(\"p\", {\n      children: \"Ethereum's Layer 2 (L2) scaling solutions have achieved a significant milestone, amassing over 10 million transactions daily, eclipsing the mainnet's throughput for the first time. This accomplishment signals a pivotal juncture in Ethereum's journey towards scalability.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 2,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Rising L2 Networks\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 5,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: \"Major L2 networks such as Arbitrum, Optimism, and zkSync have witnessed a steep rise in user adoption, fuelled by diminished fees and quicker transaction speeds. The swelling activity coincides with more DeFi protocols and NFT platforms launching on these scaling solutions.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 6,\n        columnNumber: 1\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 4,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(\"article\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Market Analysis\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 10,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: \"Market analysts postulate that this landmark could spur Ethereum's ecosystem growth, substantiating the effectiveness of the \\\"rollup-centric roadmap\\\" advocated by Vitalik Buterin.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 11,\n        columnNumber: 1\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 9,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(\"aside\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Future Implications\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 15,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: \"The triumph of L2s is especially opportune considering the mounting need for blockchain scalability in DeFi and gaming applications.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 16,\n        columnNumber: 1\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 14,\n      columnNumber: 1\n    }, this)]\n  }, undefined, true, {\n    fileName: \"<source.js>\",\n    lineNumber: 1,\n    columnNumber: 1\n  }, this);\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsxDEV(MDXLayout, {\n    ...props,\n    children: _jsxDEV(_createMdxContent, {\n      ...props\n    }, undefined, false, {\n      fileName: \"<source.js>\"\n    }, this)\n  }, undefined, false, {\n    fileName: \"<source.js>\"\n  }, this) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n",
      "frontmatter": {},
      "scope": {}
    }
  },
  {
    "slug": "eu-watchdog-wants-insurers-crypto-holdings-100-covered-citing-volatility",
    "title": " EU watchdog wants insurers’ crypto holdings 100% covered, citing volatility ",
    "date": "2025-03-28",
    "description": "The European Union’s insurance authority has proposed a blanket rule that would mandate insurance firms to maintain capital equal to the value of their crypto holdings as part of a measure to mitigate risks for policyholders. The new proposal — made by the European Insurance and Occupational Pensions Authority in a Technical Advice report to the European Commission on March 27 — would set a far stricter standard than other asset classes, such as stocks and real estate, which don’t even need to be half-backed. “EIOPA considers a 100% haircut in the standard formula prudent and appropriate for these assets in view of their inherent risks and high volatility,” it said in a separate statement. Such a measure would fill a regulatory gap between the Capital Requirements Regulation and Markets in Crypto-Assets Regulation (MiCA), EIOPA said, noting that the European Union’s regulatory framework for insurers currently lacks specific provisions on crypto assets.\nCircle argued in January that a blanket 100% stress factor on crypto assets didn’t account for lower-risk stablecoins. Source: Circle \nEIOPA outlined four options for the European Commission to consider — one: make no changes; two: mandate an 80% “stress level” to crypto assets; and three: mandate a 100% stress level to crypto asset.  The stress level percentages determine how much capital firms need to hold to stay solvent. The fourth option called on the European Commission to consider the risks of tokenized assets more broadly. EIOPA said option three would be the most appropriate option. “An 80% stress to the value of crypto-asset exposures does not appear sufficiently prudent,” whereas “a 100% stress is more appropriate and aligns with one of the approaches to the transitional treatment of crypto-assets under CRR,” EIOPA said. The 100% stress refers to the assumption that the crypto asset prices could fall by 100% and that diversification — spreading the risk across different assets — wouldn’t not reduce this stress. EIOPA pointed out that Bitcoin (BTC) and Ether (ETH) have fallen 82% and 91%, respectively, in the past. A 100% capital charge for crypto assets would reflect a far stricter approach compared to stocks, which range between 39% and 49%, and real estate, which incurs a 25% capital charge, according to solvency capital requirements laid out in the Commission Delegated Regulation 2015/35. EIOPA said a 100% capital charge for crypto asset-related (re)insurance undertakings shouldn’t be “overly burdensome” and that there would be no material costs for policyholders. “The capital requirements would fully capture the risk of crypto-asset with a positive impact on policyholder protection in case there are material exposures in the future.” Related: Tabit offers USD insurance policies backed by Bitcoin regulatory capital EIOPA acknowledged that the share of crypto-asset (re)insurance undertakings accounts for just 655 million euros or 0.0068% of all undertakings in Europe — even referring to it as “immaterial.” “At the same time crypto assets are high risk investments which may result in total loss of value,” EIOPA said, explaining why it recommends option three. Luxembourg and Sweden could be hit hardest by the proposed rule Insurers in Luxembourg and Sweden are likely to be the most affected, according to a Q4 2023 report cited by EIOPA, which found that these two countries accounted for 69% and 21% of all crypto asset-related exposures among (re)insurance undertakings. Ireland, Denmark and Liechtenstein also accounted for 3.4%, 1.4% and 1.2% of the undertakings.  Most of these undertakings are structured within funds, such as exchange-traded funds, and held on behalf of unit-linked policyholders, EIOPA noted.\nSplit of crypto-asset exposure proxy per European country in Q4 2023. Source: EIOPA\nEIOPA, however, acknowledged that a broader adoption of crypto assets in the future may require a more “differentiated approach.” Magazine: Crypto fans are obsessed with longevity and biohacking: Here’s why",
    "categories": [
      "Cryptocurrency"
    ],
    "tags": [
      "News",
      "Crypto"
    ],
    "content": {
      "compiledSource": "\"use strict\";\nconst {jsxDEV: _jsxDEV} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  return _jsxDEV(\"section\", {\n    children: [_jsxDEV(\"h2\", {\n      children: \"EU Watchdog Advocates for Insurers' Crypto Holdings to be Fully Covered, Citing Volatility\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 3,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"The European Union's insurance regulator has proposed a comprehensive rule that would require insurance firms to hold capital equal to the value of their crypto holdings. This approach aims to alleviate the potential risks faced by policyholders.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 5,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"The recommendation by the European Insurance and Occupational Pensions Authority (EIOPA) in their latest Technical Advice report to the European Commission sets a far stricter standard compared to other asset classes such as stocks and real estate. The latter classes do not need to be backed to such an extent.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 7,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"In their statement, EIOPA reasoned that considering the inherent risks and high volatility of these assets, a 100% reserve would be prudent and appropriate.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 9,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"EIOPA suggests that such a rule would bridge the regulatory gap between the Capital Requirements Regulation and the Markets in Crypto-Assets Regulation (MiCA). Currently, the European Union's regulatory framework for insurers lacks specific provisions on crypto assets.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 11,\n      columnNumber: 3\n    }, this), _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Analyzing the Options\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 14,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"The European Insurance Authority put forth four options for the European Commission to consider. They could either make no changes, impose a stress level of 80% or 100% on crypto assets or consider the risks of tokenized assets more comprehensively. The stress level determines the amount of capital firms need to hold to remain solvent.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 16,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"In EIOPA's view, option three, mandating a 100% stress level, would be the most appropriate. A less stringent 80% stress level, they believe, is not prudent enough. The assumption behind the 100% stress level is that the prices of crypto assets could fall entirely, and diversification across different assets would not mitigate this risk.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 18,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"As history has shown, Bitcoin and Ether have witnessed falls of 82% and 91% respectively. A 100% capital charge for crypto assets would reflect a far stricter approach compared to stocks and real estate, which range between 39% and 49%, and 25% respectively under the solvency capital requirements.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 20,\n        columnNumber: 5\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 13,\n      columnNumber: 3\n    }, this), _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Impact on Insurers and Policyholders\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 24,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"According to EIOPA, enforcing a 100% capital charge for crypto-related insurance undertakings should not impose burdensome demands. They also believe the approach will not incur substantial costs for policyholders.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 26,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"The stringent capital requirements would protect policyholders if there are significant exposures to crypto assets in the future. The insurance regulator maintains that although crypto assets account for a small fraction (0.0068%) of all insurance undertakings in Europe, they are high-risk investments that could potentially lose all their value.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 28,\n        columnNumber: 5\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 23,\n      columnNumber: 3\n    }, this), _jsxDEV(\"h2\", {\n      children: \"Major European Players Affected\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 31,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"Insurers in Luxembourg and Sweden, who account for the majority of crypto asset-related exposures (69% and 21% respectively), are likely to be the most affected by the proposed rule. Ireland, Denmark, and Liechtenstein will also see impacts, albeit to a lesser extent.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 33,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"Most of these exposures are structured within funds like exchange-traded funds, and held on behalf of unit-linked policyholders.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 35,\n      columnNumber: 3\n    }, this), _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Future Implications and Challenges\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 38,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"Yet, EIOPA recognizes that a more \\\"differentiated approach\\\" may be necessary in response to wider adoption of crypto assets in the future. Balancing risk, capital requirements, and the growth of the crypto insurance market will likely continue to be a significant challenge for regulators and companies alike.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 40,\n        columnNumber: 5\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 37,\n      columnNumber: 3\n    }, this)]\n  }, undefined, true, {\n    fileName: \"<source.js>\",\n    lineNumber: 2,\n    columnNumber: 1\n  }, this);\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsxDEV(MDXLayout, {\n    ...props,\n    children: _jsxDEV(_createMdxContent, {\n      ...props\n    }, undefined, false, {\n      fileName: \"<source.js>\"\n    }, this)\n  }, undefined, false, {\n    fileName: \"<source.js>\"\n  }, this) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n",
      "frontmatter": {},
      "scope": {}
    }
  },
  {
    "slug": "france-s-state-bank-earmarks-27m-for-crypto-with-strong-french-footprint",
    "title": " France’s state bank earmarks $27M for crypto with ‘strong French footprint’ ",
    "date": "2025-03-28",
    "description": "France’s state-owned bank says it will spend 25 million euros ($27 million) buying cryptocurrencies that support local crypto and blockchain projects. Bpifrance said in a March 27 press release that it would back newly formed projects “with a strong French footprint” where it will receive tokens in return for its investment and will look to fund decentralized finance (DeFi), staking, tokenization and artificial intelligence. It added that the plan, supported by the French Ministry of Economy and Finance, was to “promote emerging technologies and strengthen the French blockchain ecosystem.” The global blockchain ecosystem is “currently booming” but the number of French funds taking part is still very limited, it said.  French digital and AI minister Clara Chappaz said public and private financing was “one of the keys to the sustainable positioning of our ecosystem on the international stage.” Bpifrance deputy CEO Arnaud Caudoux said that it was convinced of the growing importance that blockchain companies “will take on in the years to come and want to increase French competitiveness and presence in the digital assets field.” “The US is really accelerating its own crypto strategy, so this is all the more important,” Caudoux said at a press conference, as reported by Reuters. He added that Bpifrance had started to support crypto before the US started its own pro-crypto moves.\nBpifrance’s headquarters in Paris. Source: Google\nThe bank said it had backed the blockchain sector for a decade and had invested over 150 million euros ($162 million), notably helping to finance the crypto hardware wallet company Ledger in 2014. Bpifrance said it began testing limited investments through tokens in 2022, including a deal with the DeFi lending platform Morpho to buy its token — which has grown to be the 12th largest protocol by value at $3.24 billion, according to DefiLlama. Related: Bybit removed from French regulator’s blacklist, eyes MiCA license Venture capitalists often take part in investments paid in tokens. PitchBook expects crypto VC deals to top $18 billion this year, a marked increase from the $13.6 billion raised in 2024. Typically, a crypto platform that launches a token will allocate a portion of its supply to financiers subject to varying lockup periods where the tokens can’t be sold. A portion of the token supply is usually immediately given to select public users in order to drum up liquidity, which can cause token values to slide if they cash out. Magazine: How crypto laws are changing across the world in 2025",
    "categories": [
      "Cryptocurrency"
    ],
    "tags": [
      "News",
      "Crypto"
    ],
    "content": {
      "compiledSource": "\"use strict\";\nconst {jsxDEV: _jsxDEV} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  return _jsxDEV(\"section\", {\n    children: [_jsxDEV(\"h2\", {\n      children: \"France's State Bank Invests $27M in Locally-focused Crypto\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 3,\n      columnNumber: 1\n    }, this), _jsxDEV(\"p\", {\n      children: \"A major financial move in the crypto space – France’s state-owned bank, Bpifrance, has divulged plans to invest 25 million euros ($27 million) into cryptocurrencies. This substantial injection of capital is specifically earmarked for local crypto and blockchain projects.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 5,\n      columnNumber: 1\n    }, this), _jsxDEV(\"p\", {\n      children: [\"According to a \", _jsxDEV(\"a\", {\n        href: \"https://presse.bpifrance.fr/bpifrance-annonce-lacceleration-de-sa-strategie-dinvestissement-en-actifs-numeriques\",\n        target: \"_blank\",\n        children: \"press release\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 7,\n        columnNumber: 19\n      }, this), \" from Bpifrance on March 27, the bank intends to support innovative ventures \\\"with a strong French footprint\\\". In exchange for its investment, Bpifrance will receive tokens and aims to finance areas such as decentralized finance (DeFi), staking, tokenization, and artificial intelligence.\"]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 7,\n      columnNumber: 1\n    }, this), _jsxDEV(\"h3\", {\n      children: \"Upholding France's Position in the Blockchain Ecosystem\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 9,\n      columnNumber: 1\n    }, this), _jsxDEV(\"p\", {\n      children: \"The move resonates with the French Ministry of Economy and Finance's goal to propagate emerging technologies and fortify the French blockchain environment. Despite the current global surge in blockchain development, French funds remain sparse.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 11,\n      columnNumber: 1\n    }, this), _jsxDEV(\"p\", {\n      children: [\"Clara Chappaz, the French digital and AI minister, expresses that \", _jsxDEV(\"a\", {\n        href: \"https://cointelegraph.com/news/crypto-venture-capitalist-one-billion-two-new-crypto-funds\",\n        target: \"_blank\",\n        children: \"both public and private financing\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 13,\n        columnNumber: 70\n      }, this), \" are instrumental in sustaining France's international positioning in the blockchain ecosystem.\"]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 13,\n      columnNumber: 1\n    }, this), _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Fostering French Competitiveness in The Digital Assets Field\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 16,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: \"Arnaud Caudoux, deputy CEO at Bpifrance, conveyed the bank's conviction that blockchain companies will hold increasing importance in the forthcoming years. Therefore, intensifying French competitiveness and presence in the digital assets space is paramount. This maneuver becomes all the more significant as the United States accelerates its own crypto strategy.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 18,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: \"Reportedly, Bpifrance has also begun backing crypto projects even before the US initiated its pro-crypto movement.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 20,\n        columnNumber: 1\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 15,\n      columnNumber: 1\n    }, this), _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Evidence of Prior Crypto Support\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 24,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: \"Bpifrance has already been a longstanding supporter of the blockchain sector, with investments exceeding 150 million euros ($162 million). A notable beneficiary of this support includes Ledger, a crypto hardware wallet company that the bank helped finance back in 2014.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 26,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: [\"The bank’s embrace of token investments started as early as 2022. It embarked on a deal with Morpho, a DeFi lending platform, to purchase its tokens. Morpho has since grown into the 12th largest protocol by value at $3.24 billion, \", _jsxDEV(\"a\", {\n          href: \"https://defillama.com/protocol/morpho\",\n          target: \"_blank\",\n          children: \"according to DefiLlama\"\n        }, undefined, false, {\n          fileName: \"<source.js>\",\n          lineNumber: 28,\n          columnNumber: 235\n        }, this), \".\"]\n      }, undefined, true, {\n        fileName: \"<source.js>\",\n        lineNumber: 28,\n        columnNumber: 1\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 23,\n      columnNumber: 1\n    }, this), _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Predicted Growth in Crypto VC Deals\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 32,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: [\"Many venture capitalists participate in investments paid in tokens. According to PitchBook, crypto VC deals are predicted to \", _jsxDEV(\"a\", {\n          href: \"https://cointelegraph.com/news/crypto-vc-deals-february-defi-the-tie\",\n          target: \"_blank\",\n          children: \"exceed $18 billion this year\"\n        }, undefined, false, {\n          fileName: \"<source.js>\",\n          lineNumber: 34,\n          columnNumber: 129\n        }, this), \". This uptick marks a considerable jump from the $13.6 billion raised in 2024.\"]\n      }, undefined, true, {\n        fileName: \"<source.js>\",\n        lineNumber: 34,\n        columnNumber: 1\n      }, this), _jsxDEV(\"p\", {\n        children: \"Normally, a crypto platform launching a token will distribute a certain portion of its supply to financiers. This supply, however, is subject to varying lockup periods during which the tokens cannot be sold. Select public users are also given a portion of the token supply to spur liquidity, which may depreciate token values if they decide to cash out.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 36,\n        columnNumber: 1\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 31,\n      columnNumber: 1\n    }, this)]\n  }, undefined, true, {\n    fileName: \"<source.js>\",\n    lineNumber: 2,\n    columnNumber: 1\n  }, this);\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsxDEV(MDXLayout, {\n    ...props,\n    children: _jsxDEV(_createMdxContent, {\n      ...props\n    }, undefined, false, {\n      fileName: \"<source.js>\"\n    }, this)\n  }, undefined, false, {\n    fileName: \"<source.js>\"\n  }, this) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n",
      "frontmatter": {},
      "scope": {}
    }
  },
  {
    "slug": "gamestop-plans-bitcoin-investment",
    "title": "GameStop Follows MicroStrategy's Lead, Plans $1.3B Bitcoin Buy",
    "date": "2025-03-27",
    "description": "Gaming retailer GameStop announces plans to invest $1.3B in Bitcoin through convertible notes offering, following MicroStrategy's corporate treasury strategy.",
    "categories": [
      "Bitcoin",
      "Investments",
      "Corporate Strategy"
    ],
    "tags": [
      "GameStop",
      "Bitcoin Investment",
      "Corporate Treasury",
      "MicroStrategy",
      "Convertible Notes"
    ],
    "content": {
      "compiledSource": "\"use strict\";\nconst {Fragment: _Fragment, jsxDEV: _jsxDEV} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = {\n    em: \"em\",\n    h2: \"h2\",\n    li: \"li\",\n    p: \"p\",\n    ul: \"ul\",\n    ..._provideComponents(),\n    ...props.components\n  };\n  return _jsxDEV(_Fragment, {\n    children: [_jsxDEV(_components.p, {\n      children: \"In a bold move that mirrors MicroStrategy's Bitcoin strategy, gaming retail giant GameStop has announced plans to raise $1.3 billion through convertible notes to invest in Bitcoin. This decision marks another significant step in the mainstream adoption of cryptocurrency by major corporations.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 2,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.h2, {\n      children: \"Investment Policy Update\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 4,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.p, {\n      children: \"GameStop's board of directors has unanimously approved an update to its investment policy, enabling the company to allocate capital into Bitcoin. The gaming retailer plans to use the net proceeds from their offering for \\\"general corporate purposes, including the acquisition of Bitcoin\\\" in alignment with their new investment strategy.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 6,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.h2, {\n      children: \"Funding Structure\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 8,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.p, {\n      children: \"The company's approach involves:\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 10,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.ul, {\n      children: [\"\\n\", _jsxDEV(_components.li, {\n        children: \"Issuing $1.3 billion in 0.00% Convertible Senior Notes due 2030\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 11,\n        columnNumber: 1\n      }, this), \"\\n\", _jsxDEV(_components.li, {\n        children: \"Offering initial purchasers an additional $200 million option within 13 days\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 12,\n        columnNumber: 1\n      }, this), \"\\n\", _jsxDEV(_components.li, {\n        children: \"Notes will be unsecured obligations with no regular interest\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 13,\n        columnNumber: 1\n      }, this), \"\\n\", _jsxDEV(_components.li, {\n        children: \"Maturity date set for April 1, 2030\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 14,\n        columnNumber: 1\n      }, this), \"\\n\", _jsxDEV(_components.li, {\n        children: \"Flexible conversion options including cash, Class A common stock, or both\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 15,\n        columnNumber: 1\n      }, this), \"\\n\"]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 11,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.h2, {\n      children: \"Market Impact and Analysis\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 17,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.p, {\n      children: \"This move positions GameStop alongside other forward-thinking corporations that are diversifying their balance sheets with Bitcoin. Following MicroStrategy's lead, this decision signals growing confidence in cryptocurrency as a treasury reserve asset among traditional businesses.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 19,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.p, {\n      children: \"The gaming retailer's entrance into the crypto space could potentially influence other companies in the retail sector to consider similar strategies. However, investors should note that the offering's completion isn't guaranteed and will depend on market conditions and regulatory requirements.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 21,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.h2, {\n      children: \"Looking Ahead\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 23,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.p, {\n      children: \"As more corporations adopt Bitcoin as a treasury reserve asset, we might be witnessing a broader shift in corporate finance strategies. GameStop's decision could set a precedent for other retail companies looking to modernize their treasury management approaches.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 25,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(_components.p, {\n      children: _jsxDEV(_components.em, {\n        children: \"Note: This article is for informational purposes only and should not be considered financial advice.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 27,\n        columnNumber: 1\n      }, this)\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 27,\n      columnNumber: 1\n    }, this)]\n  }, undefined, true, {\n    fileName: \"<source.js>\",\n    lineNumber: 1,\n    columnNumber: 1\n  }, this);\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsxDEV(MDXLayout, {\n    ...props,\n    children: _jsxDEV(_createMdxContent, {\n      ...props\n    }, undefined, false, {\n      fileName: \"<source.js>\"\n    }, this)\n  }, undefined, false, {\n    fileName: \"<source.js>\"\n  }, this) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n",
      "frontmatter": {},
      "scope": {}
    }
  },
  {
    "slug": "our-gpus-are-melting-openai-puts-limiter-in-after-ghibli-tsunami",
    "title": " ‘Our GPUs are melting’ — OpenAI puts limiter in after Ghibli-tsunami ",
    "date": "2025-03-28",
    "description": "ChatGPT creators OpenAI have introduced rate limits after a viral social media trend that saw nearly everything “Ghiblifyied” — turned into AI art in the style of the famous Japanese animation studio.  OpenAI CEO Sam Altman was one of the first to take part in the trend, posting a portrait of himself generated by the model on March 25 but said in a subsequent post two days later that all image requests have started to tax the firm’s infrastructure. “It’s super fun seeing people love images in ChatGPT but our GPUs are melting. We are going to temporarily introduce some rate limits while we work on making it more efficient,” he said.\nSource: Sam Altman\n“Also, we are refusing some generations that should be allowed; we are fixing these as fast we can,” he added. OpenAI launched the upgraded image generation offering in ChatGPT-4o on March 25, resulting in users splashing images across social media in the art style of Studio Ghibli — known for its anime films Spirited Away and My Neighbor Totoro. Altman didn’t give a definitive timeline on how long the rate limits would last but said, “Hopefully, it won’t be long! ChatGPT free tier will get three generations per day soon.” Rate limits are generally applied to help OpenAI manage the aggregate load on its infrastructure, according to OpenAI.  Related: Ghibli memecoins surge as internet flooded with Studio Ghibli-style AI images “If requests to the API increase dramatically, it could tax the servers and cause performance issues. By setting rate limits, OpenAI can help maintain a smooth and consistent experience for all users,” OpenAI says on its rate limit explanation page. Along with the legions of others getting in on the trend, X and Tesla CEO Elon Musk shared an image mimicking King Mufasa from Disney’s The Lion King holding up a Shiba Inu.  White House AI and crypto czar David Sacks also joined in, using the Studio Ghibli-art style on an image of himself at an event.\nSource: David Sacks\nMeanwhile, Bloomberg reported on March 26 that OpenAI expects to more than triple its revenue this year to $12.7 billion, citing a person familiar with the matter. Altman said on Feb. 12 his firm wants to ship GPT-4.5 and GPT-5 in the coming weeks or months. Magazine: ‘Chernobyl’ needed to wake people to AI risks, Studio Ghibli memes: AI Eye",
    "categories": [
      "Cryptocurrency"
    ],
    "tags": [
      "News",
      "Crypto"
    ],
    "content": {
      "compiledSource": "\"use strict\";\nconst {Fragment: _Fragment, jsxDEV: _jsxDEV} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  return _jsxDEV(_Fragment, {\n    children: [_jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"OpenAI Introduces Rate Limits Following Ghibli-inspired Art Trend\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 3,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: [\"OpenAI, the team behind ChatGPT, has found it necessary to implement rate limits following a viral trend of AI generated artwork in the style of the renowned Japanese animation Studio Ghibli. OpenAI CEO Sam Altman participated in the trend by \", _jsxDEV(\"a\", {\n          href: \"https://x.com/sama/status/1904599358756315341\",\n          children: \"posting\"\n        }, undefined, false, {\n          fileName: \"<source.js>\",\n          lineNumber: 4,\n          columnNumber: 251\n        }, this), \" a self-portrait on March 25. However, the trend quickly became so popular that it began to strain the company's resources.\"]\n      }, undefined, true, {\n        fileName: \"<source.js>\",\n        lineNumber: 4,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: [\"In response, Altman \", _jsxDEV(\"a\", {\n          href: \"https://x.com/sama/status/1905296867145154688?s=46&amp;t=MuRujqZUAz3TQE1vmr3c6A\",\n          children: \"stated\"\n        }, undefined, false, {\n          fileName: \"<source.js>\",\n          lineNumber: 5,\n          columnNumber: 28\n        }, this), \" that due to the excess in image requests, they have started to put a strain on the firm's infrastructure. \\\"It's super fun seeing people love images in ChatGPT but our GPUs are melting. We are going to temporarily introduce some rate limits while we work on making it more efficient,\\\" he said.\"]\n      }, undefined, true, {\n        fileName: \"<source.js>\",\n        lineNumber: 5,\n        columnNumber: 5\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 2,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Response to the Trend\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 9,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: [\"Altman also mentioned that requests that should have been granted were being denied, a problem which they were addressing as quickly as possible. The updated image generation platform, ChatGPT-4o, was \", _jsxDEV(\"a\", {\n          href: \"https://openai.com/index/introducing-4o-image-generation/\",\n          children: \"launched\"\n        }, undefined, false, {\n          fileName: \"<source.js>\",\n          lineNumber: 10,\n          columnNumber: 209\n        }, this), \" on March 25, leading to a deluge of Ghibli-inspired art on social media. This reveals how influential Studio Ghibli has been, with productions such as Spirited Away and My Neighbor Totoro marking their distinct style.\"]\n      }, undefined, true, {\n        fileName: \"<source.js>\",\n        lineNumber: 10,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"OpenAI's CEO has yet to provide a specific timeline for the duration of these rate limits, but reassured users that \\\"hopefully, it won't be long! ChatGPT free tier will get three generations per day soon.\\\" Rate limits are usually put in place to allow OpenAI to manage the aggregate workload on its infrastructure. If API requests drastically increase, this could lead to server congestion and performance issues. By implementing rate limits, OpenAI ensure a more consistent and smooth user experience.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 11,\n        columnNumber: 9\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 8,\n      columnNumber: 1\n    }, this), \"\\n\", _jsxDEV(\"section\", {\n      children: [_jsxDEV(\"h2\", {\n        children: \"Impact and Future Implications\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 15,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"Entrepreneur Elon Musk and White House AI advisor David Sacks also joined the trend, each sharing images generated in the signature Ghibli style. This goes to show the potential influence and reach of AI technology, not just as a tool for developers and researchers, but also as a medium for art and self-expression. As AI continues to develop, we are likely to see it permeate more and more into popular culture.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 16,\n        columnNumber: 5\n      }, this), _jsxDEV(\"p\", {\n        children: \"In terms of OpenAI's future prospects, there are signs of significant growth. An individual familiar with the topic reported to Bloomberg that OpenAI expects to more than triple its 2025 revenue to over $12.7 billion. Furthermore, Altman suggested that they plan to deploy GPT-4.5 and GPT-5 in the upcoming weeks or months, indicating the continual progress and expansion of the platform.\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 17,\n        columnNumber: 5\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 14,\n      columnNumber: 1\n    }, this)]\n  }, undefined, true, {\n    fileName: \"<source.js>\",\n    lineNumber: 1,\n    columnNumber: 1\n  }, this);\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsxDEV(MDXLayout, {\n    ...props,\n    children: _jsxDEV(_createMdxContent, {\n      ...props\n    }, undefined, false, {\n      fileName: \"<source.js>\"\n    }, this)\n  }, undefined, false, {\n    fileName: \"<source.js>\"\n  }, this) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n",
      "frontmatter": {},
      "scope": {}
    }
  },
  {
    "slug": "us-doj-says-it-seized-hamas-crypto-meant-to-finance-terrorism",
    "title": " US DOJ says it seized Hamas crypto meant to finance terrorism ",
    "date": "2025-03-28",
    "description": "The US Justice Department (DOJ) seized more than $200,000 in cryptocurrency intended to benefit the militant group Hamas it said in a statement on March 27.  The cryptocurrency with a total value of $201,400 was traced to fundraising addresses allegedly controlled by Hamas and used to launder more than $1.5 million in digital assets since October 2024.  The laundering occurred through a series of “virtual currency exchanges and transactions by leveraging suspected financiers and over-the-counter brokers,” the DOJ said. The funds are currently held in a combination of at least 17 wallets.\nAffidavit to seize the Hamas-linked cryptocurrency. Source: US DOJ\nIn January 2024, the US Treasury’s Office of Foreign Assets Control, along with corresponding organizations in the United Kingdom and Australia, announced sanctions against networks and facilitators of crypto transactions linked to Hamas. Those sanctions were built on US Treasury sanctions from October 2023. In January 2024, three families of victims of the Hamas attack against Israel sued Binance and its former CEO Changpeng Zhao, alleging that the exchange had provided “substantial assistance” to terrorists. In oral arguments, a lawyer representing Binance claimed the exchange had “no special relationship [with] Hamas […].” Binance has faced scrutiny from the US government over alleged shortcomings in its Anti-Money Laundering controls. The exchange settled with the DOJ for $4.3 billion in November 2023. More regulation needed? According to a December 2024 report by the Congressional Research Service, Hamas has allegedly sought cryptocurrency donations since at least 2019, although the “scale and effectiveness” of these efforts have been unclear. Terrorist organizations using crypto for fundraising have increasingly drawn the attention of the US, with some officials questioning whether the industry needed more supervision or regulation to stop such behavior. According to a 2023 Chainalysis report, terrorism financing accounts for a very small amount of crypto usage, with illegal groups sticking to using traditional, fiat-based methods to fund operations. Magazine: Terrorism and the Israel-Gaza war have been weaponized to destroy crypto",
    "categories": [
      "Cryptocurrency"
    ],
    "tags": [
      "News",
      "Crypto"
    ],
    "content": {
      "compiledSource": "\"use strict\";\nconst {jsxDEV: _jsxDEV} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  return _jsxDEV(\"section\", {\n    children: [_jsxDEV(\"h2\", {\n      children: \"US DOJ Seizes Hamas Crypto Intended for Terrorism Financing\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 3,\n      columnNumber: 3\n    }, this), _jsxDEV(\"figure\", {\n      children: [_jsxDEV(\"img\", {\n        src: \"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWQ5NTAtMDhjMC03YzdkLTlhOGYtNTFkNTE4ZmY3ODAx.jpg\",\n        alt: \"US DOJ says it seized Hamas crypto meant to finance terrorism\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 5,\n        columnNumber: 5\n      }, this), _jsxDEV(\"figcaption\", {\n        children: \"Affidavit to seize the Hamas-linked cryptocurrency. Source: US DOJ\"\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 6,\n        columnNumber: 5\n      }, this)]\n    }, undefined, true, {\n      fileName: \"<source.js>\",\n      lineNumber: 4,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"The US Justice Department (DOJ) announced the seizure of over $200,000 in cryptocurrency, which was allegedly meant to finance the militant group Hamas. A DOJ statement dated March 27 stated that this crypto amounting to $201,400 was traced back to fundraising addresses controlled by Hamas. These were reportedly used to launder over $1.5 million in digital assets since October 2024. The laundering operation leveraged “virtual currency exchanges and transactions through suspected financiers and over-the-counter brokers”. The funds are now held in a combination across 17 wallets.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 8,\n      columnNumber: 3\n    }, this), _jsxDEV(\"h3\", {\n      children: \"Hamas, Crypto, and Sanctions\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 9,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"In January 2024, the US Treasury’s Office of Foreign Assets Control (OFAC), along with analogous organizations in the United Kingdom and Australia, announced sanctions against networks and facilitators of crypto transactions associated with Hamas. These sanctions were an evolution of US Treasury sanctions enforced in October 2023. Later in January, three families of victims from a Hamas attack against Israel sued Binance and its former CEO Changpeng Zhao, accusing the exchange of providing \\\"substantial assistance\\\" to terrorists. The case saw a Binance lawyer argue that there was \\\"no special relationship\\\" between the exchange and Hamas.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 10,\n      columnNumber: 3\n    }, this), _jsxDEV(\"h3\", {\n      children: \"Binance Scrutiny and Settlement\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 11,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"Binance has previously faced scrutiny from the US government over perceived failings in its Anti-Money Laundering controls. The exchange settled with the DOJ for $4.3 billion in November 2023. There are suggestions that this latest seizure could further inflame the narrative around tighter crypto regulation, given the context of terrorism financing.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 12,\n      columnNumber: 3\n    }, this), _jsxDEV(\"h2\", {\n      children: \"Are More Regulations Required?\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 13,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"A report by the Congressional Research Service in December 2024 indicated that Hamas has allegedly been attempting to garner crypto donations since, at least, 2019. The effectiveness of such endeavours remains unclear. An increasing awareness about terrorist organizations opting for crypto fundraising has led some US officials to question if the industry requires greater supervision or regulations.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 14,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: \"However, a 2023 report from analytics firm Chainalysis stated that terrorism financing accounts for only a minute fraction of overall crypto usage, with illicit groups still primarily using traditional, fiat-based methods for fundraising activities. Thus, future regulation might need to incorporate this broader perspective.\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 15,\n      columnNumber: 3\n    }, this), _jsxDEV(\"h4\", {\n      children: \"Read More:\"\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 16,\n      columnNumber: 3\n    }, this), _jsxDEV(\"p\", {\n      children: _jsxDEV(\"em\", {\n        children: _jsxDEV(\"strong\", {\n          children: _jsxDEV(\"a\", {\n            href: \"https://cointelegraph.com/magazine/how-terror-israel-gaza-war-being-weaponized-destroy-crypto/\",\n            children: \"Terrorism and the Israel-Gaza war have been weaponized to destroy crypto\"\n          }, undefined, false, {\n            fileName: \"<source.js>\",\n            lineNumber: 17,\n            columnNumber: 18\n          }, this)\n        }, undefined, false, {\n          fileName: \"<source.js>\",\n          lineNumber: 17,\n          columnNumber: 10\n        }, this)\n      }, undefined, false, {\n        fileName: \"<source.js>\",\n        lineNumber: 17,\n        columnNumber: 6\n      }, this)\n    }, undefined, false, {\n      fileName: \"<source.js>\",\n      lineNumber: 17,\n      columnNumber: 3\n    }, this)]\n  }, undefined, true, {\n    fileName: \"<source.js>\",\n    lineNumber: 2,\n    columnNumber: 1\n  }, this);\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsxDEV(MDXLayout, {\n    ...props,\n    children: _jsxDEV(_createMdxContent, {\n      ...props\n    }, undefined, false, {\n      fileName: \"<source.js>\"\n    }, this)\n  }, undefined, false, {\n    fileName: \"<source.js>\"\n  }, this) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n",
      "frontmatter": {},
      "scope": {}
    }
  }
]